loadtest/remote.yaml
config:
  target: "https://asteroids.yarekt.co.uk/"
  socketio:
    transports: ["websocket"]
  phases:
    - duration: 1
      arrivalRate: 200
scenarios:
  - name: Socket
    engine: socketio
    flow:
    - log: "testing websocket"
    - think: 10
    - emit:
        channel: command
        data: fire
    - think: 9999